Repository: IQTechSolutions/ConectOne
Catalog: Projects/EversdalPrimary/EversdalPrimary.Blazor.Pwa/Resources/Pages.Shop.Invoices.*.resx
Languages: af

source: Processed Orders
af: Verwerkte Bestellings

# ProcessedOrdersDescription
source: Invoices that have been paid and are available for you to download for your own records.
af: Fakture wat betaal is en beskikbaar is om vir jou rekords af te laai.

source: Pending Payment
af: Hangende Betaling

# CompletedAndShipped
source: Completed & Shipped
af: Voltooi & Gestuur

# SupportNotice
source: Payments that have failed to process. Please contact support for more information
af: Betalings wat nie verwerk kon word nie. Kontak asseblief ondersteuning vir meer inligting

# FullPaid
source: Paid in Full
af: Ten volle betaal

source: Rejected Payments
af: Geweierde Betalings

source: Rejected
af: Geweier

source: Call Support
af: Skakel Ondersteuning

source: Shopping
af: Inkopies

source: Order History
af: Bestelgeskiedenis
