Repository: IQTechSolutions/ConectOne
Catalog: Projects/SchoolsEnterprise/SchoolsEnterprise.Blazor.Shared.Maui/Resources/Pages.Donations.CreateDonation.*.resx
Languages: af

# AgreeToTermsLabel
source: I agree to the donation terms and privacy policy.
af: Ek stem in tot die donasievoorwaardes en privaatheidsbeleid.

# AgreeToTermsRequired
source: Please confirm that you accept the terms before continuing.
af: Bevestig asseblief dat jy die voorwaardes aanvaar voordat jy voortgaan.

# AmountHelper
source: Enter the amount you would like to contribute.
af: Voer die bedrag in wat jy wil skenk.

# AmountLabel
source: Donation amount
af: Donasiebedrag

# AmountRequired
source: Please enter the amount you wish to donate.
af: Voer asseblief die bedrag in wat jy wil skenk.

# DesignationHelper
source: Select the fund or initiative you would like to support.
af: Kies die fonds of inisiatief wat jy wil ondersteun.

# DesignationLabel
source: Donation designation
af: Donasie-toewysing

# DonorInformationDescription
source: Tell us how we can reach you about this pledge.
af: Vertel ons hoe ons jou oor hierdie bydrae kan kontak.

# DonorInformationHeading
source: Donor information
af: Skinkerbesonderhede

# DonationDetailsDescription
source: Choose how you would like your contribution to be used.
af: Kies hoe jy wil hê ons moet jou bydrae aanwend.

# DonationDetailsHeading
source: Donation details
af: Donasie besonderhede

# DonationDesignationFacilities
source: Facilities & maintenance
af: Fasiliteite & instandhouding

# DonationDesignationGeneral
source: General fund
af: Algemene fonds

# DonationDesignationOther
source: Other
af: Ander

# DonationDesignationScholarship
source: Scholarship fund
af: Beursfonds

# DonationDesignationSports
source: Sports programmes
af: Sportprogramme

# EmailLabel
source: Email address
af: E-posadres

# EmailRequired
source: Please enter a valid email address.
af: Verskaf asseblief 'n geldige e-posadres.

# FrequencyAnnually
source: Annually
af: Jaarliks

# FrequencyLabel
source: Donation frequency
af: Donasie-frekwensie

# FrequencyMonthly
source: Monthly
af: Maandeliks

# FrequencyOnceOff
source: Once-off
af: Eenmalig

# FrequencyQuarterly
source: Quarterly
af: Kwartaaliks

# FrequencyRequired
source: Please choose how often we should collect this donation.
af: Kies asseblief hoe gereeld ons hierdie donasie moet verhaal.

# FullNameLabel
source: Full name
af: Volle naam

# FullNameRequired
source: Let us know who the donation is from.
af: Laat ons weet van wie die donasie afkomstig is.

# GenericError
source: We could not process your donation right now. Please try again shortly.
af: Ons kon nie jou donasie nou verwerk nie. Probeer asseblief weer later.

# IsAnonymousLabel
source: Make this donation anonymous
af: Maak hierdie donasie anoniem

# IsRecurringLabel
source: Set up a recurring donation
af: Stel 'n herhalende donasie op

# MessageHelper
source: Share a message of support or any instructions for our team.
af: Deel 'n boodskap van ondersteuning of enige instruksies vir ons span.

# MessageLabel
source: Message to the school (optional)
af: Boodskap aan die skool (opsioneel)

# PageDescription
source: Complete the form below to pledge a donation to Nelspruit High School.
af: Voltooi die onderstaande vorm om 'n donasie aan Nelspruit Hoërskool te beloof.

# PageHeading
source: Support Nelspruit High School
af: Ondersteun Nelspruit Hoërskool

# PageTitle
source: Create donation
af: Skep donasie

# PhoneLabel
source: Phone number
af: Telefoonnommer

# SubmittingButton
source: Submittingâ€¦
af: Dien tans in…

# SubmitButton
source: Submit donation
af: Dien donasie in

# SuccessMessage
source: Thank you! Your donation pledge has been submitted.
af: Dankie! Jou donasiebelofte is suksesvol ingedien.
